/*
this is where towns will be
*/

{
  "ID:1":{
    "name":"town 1",
    "notes":"notes"
  },
  "ID:2":{
    "name":"The settlement's name is presented first.",
    "alignment":"A settlement's alignment is the general alignment of its citizens and government—individuals who dwell therein can still be of any alignment, but the majority of its citizens should be within one step of the settlement's overall alignment. Alignment influences a city's modifiers.",
    "type":"The type is the size category the settlement falls into, be it thorpe, hamlet, village, town (small or large), city (small or large), or metropolis. In most cases, rules play off of a settlement's type rather than its exact population total. A settlement's type determines many of its statistics",
    "modifiers":"Settlements possess six modifiers that apply to specific skill checks made in the settlement. A settlement's starting modifier values are determined by its type. This value is further adjusted by the settlement's alignment, government, qualities, and disadvantages. Note that introducing settlement modifiers to your game will somewhat increase the complexity of skill checks by adding a variable modifier each time the PCs visit a new town or city—consider the use of these modifiers an optional rule.",
    "corruption":"Corruption measures how open a settlement's officials are to bribes, how honest its citizens are, and how likely anyone in town is to report a crime. Low corruption indicates a high level of civic honesty. A settlement's corruption modifies all Bluff checks made against city officials or guards and all Stealth checks made outside (but not inside buildings or underground).",
    "crime":"Crime is a measure of a settlement's lawlessness. A settlement with a low crime modifier is relatively safe, with violent crimes being rare or even unknown, while a settlement with a high crime modifier is likely to have A powerful thieves' guild and a significant problem with violence. The atmosphere generated by a settlement's crime level applies as a modifier on Sense Motive checks to avoid being bluffed and to Sleight of Hand checks made to pick pockets.",
    "economy":"A settlement's economy modifier indicates the health of its trade and the wealth of its successful citizens. A low economy modifier doesn't automatically mean the town is beset with poverty—it could merely indicate A town with little trade or one that is relatively self-sufficient. Towns with high economy modifiers always have large markets and many shops. A settlement's economy helps its citizens make money, and thus it applies as a modifier on all Craft, Perform, and Profession checks made to generate income.",
    "law":"Law measures how strict a settlement's laws and edicts are. A settlement with a low law modifier isn't necessarily crime-ridden—in fact, A low law modifier usually indicates that the town simply has little need for protection since crime is so rare. A high law modifier means the settlement's guards are particularly alert, vigilant, and well-organized. The more lawful A town is, the more timidly its citizens tend to respond to shows of force. A settlement's law modifier applies on Intimidate checks made to force an opponent to act friendly, Diplomacy checks against government officials, or Diplomacy checks made to call on the city guard (see sidebar).",
    "lore":"A settlement's lore modifier measures not only how willing the citizens are to chat and talk with visitors, but also how available and accessible its libraries and sages are. A low lore modifier doesn't mean the settlement's citizens are idiots, just that they're close-mouthed or simply lack knowledge resources. A settlement's lore modifier applies on Diplomacy checks made to gather information and Knowledge checks made using the city's resources to do research when using a library.",
    "society":"Society measures how open-minded and civilized A settlement's citizens are. A low society modifier might mean many of the citizens harbor prejudices or are overly suspicious of out-of-towners. A high society modifier means that citizens are used to diversity and unusual visitors and that they respond better to well-spoken attempts at conversation. A settlement's society modifier applies on all Disguise checks, as well as on Diplomacy checks made to alter the attitude of any non-government official.",
    "qualities":"All settlements have a certain number of qualities that further adjust their statistics—think of qualities as feats for settlements. A settlement's type determines how many qualities it can have.",
    "danger":"A settlement's danger value is a number that gives a general idea of how dangerous it is to live in the settlement. If you use wandering monster chart that uses percentile dice and ranks its encounters from lowest Cr to highest CR, use the modifier associated with the settlement's danger value to adjust rolls on the encounter chart. A settlement's base danger value depends on its type.",
    "disadvantages":"Any disadvantages a settlement might be suffering from are listed on this line. A settlement can have any number of disadvantages you wish to inflict on it, although most settlements have no disadvantages.",
    "government":"This entry lists how the settlement is governed and ruled. The type of government a settlement follows affects its statistics.",
    "population":"This number represents the settlement's population. Note that the exact number is flexible; a settlement's actual population can swell on market days or dwindle during winter—this number lists the average population of the settlement. Note that this number is generally used for little more than flavor—since actual population totals fluctuate, it's pointless to tether rules to this number. After the settlement's total population, a breakdown of its racial mix is listed in parentheses. A settlement's population is left to the GM to assign, but you can use a settlement's type to help you determine just how many folks live in the city. Since the actual number of people who dwell in a settlement has no impact on game play, the number you choose is largely cosmetic—feel free to adjust the suggested values below to fit your campaign.",
    "notable NPCs":"This section lists any notable NPCs who live in the city, sorted by their role in the community, followed by their name and then their alignment, gender, race, class, and level in parentheses.",
    "base Value and Purchase Limit":"This section lists the community's base value for available magic items in gp (see Table: Available Magic Items). There is a 75% chance that any item of this value or lower can be found for sale in the community with little effort. If an item is not available, a new check to determine if the item has become available can be made in 1 week. A settlement's purchase limit is the most money a shop in the settlement can spend to purchase any single item from the PCs. If the PCs wish to sell an item worth more than a settlement's purchase limit, they'll either need to settle for a lower price, travel to A larger city, or (with the GM's permission) search for a specific buyer in the city with deeper pockets. A settlement's type sets its purchase limit.",
    "spellcasting":"Unlike magic items, spellcasting for hire is listed separately from the town's base value, since spellcasting is limited by the level of the available spellcasters in town. This line lists the highest-level spell available for purchase from spellcasters in town. A town's base spellcasting level depends on its type.",
    "minor Items/Medium Items/Major Items":"This line lists the number of magic items above a settlement's base value that are available for purchase. In some city stat blocks, the actual items are listed in parentheses after the die range of items available—in this case, you can use these pre-rolled resources when the PCs first visit the city as the magic items available for sale on that visit. If the PCs return to that city at a later date, you can roll up new items as you see fit.",
    "
  }
}
